root643/unsolo-key/ch32fun/extralibs/hsusb.c
#include "hsusb.h"
#include "ch32fun.h"
#include <string.h>
#include <stdio.h>

struct _USBState USBHSCTX;
volatile uint8_t usb_debug = 0;

#ifdef CH584_CH585
static inline void mcpy_raw( void *dst, const void *start, void *end )
{
	__asm__ volatile ( ".insn r 0x0f, 0x7, 0, x0, %3, %0, %1"
	      : "+r"(start), "+r"(dst)
	      :  "r"(0), "r"(end)
	      : "memory" );
}

void * fast_memcpy( void *dst, const void *src, uint32_t size )
{
	uint32_t * end = (void *)src + size;
	mcpy_raw( dst, src, (void *)end );

	return dst;
}
#define copyBuffer fast_memcpy
// #define copyBuffer memcpy
#else
#define copyBuffer memcpy
#endif

#if (FUSB_OUT_FLOW_CONTROL > 0) && (FUSB_USER_HANDLERS < 1)
#error FUSB_OUT_FLOW_CONTROL requires FUSB_USER_HANDLERS
#endif

#if (USBHS_IMPL==2)
#define USBHS_IRQHandler USB2_DEVICE_IRQHandler
#define USBHS_IRQn USB2_DEVICE_IRQn
#endif

#define ANYPRINTF	(defined( FUNCONF_USE_DEBUGPRINTF ) && FUNCONF_USE_DEBUGPRINTF) || \
					(defined( FUNCONF_USE_UARTPRINTF ) && FUNCONF_USE_UARTPRINTF) || \
					(defined( FUNCONF_USE_USBPRINTF ) && FUNCONF_USE_USBPRINTF)

#if FUSB_USE_HPE // Will it ever work?
// There is an issue with some registers apparently getting lost with HPE, just do it the slow way.
#if defined(CH584_CH585)
void USBHS_IRQHandler() __attribute__((section(".highcode"))) __attribute((interrupt));
#else
void USBHS_IRQHandler() __attribute__((section(".text.vector_handler"))) __attribute((interrupt));
#endif
// void USBHD_IRQHandler() __attribute__((section(".text.vector_handler"))) __attribute((naked));
#else
#if defined(CH584_CH585)
void USBHS_IRQHandler() __attribute__((section(".highcode"))) __attribute((interrupt));
#else
void USBHS_IRQHandler() __attribute__((section(".text.vector_handler"))) __attribute((interrupt));
#endif
#endif

void USBHS_InternalFinishSetup();

void USBHS_IRQHandler()
{
#if FUSB_IO_PROFILE
	funDigitalWrite( DEBUG_PIN, 1 );
#endif

#if (FUSB_SOF_HSITRIM)
	uint64_t systick_local = SysTick->CNT;
#endif

	// Combined FG + ST flag.
	uint16_t intfgst = *(uint16_t*)(&USBHS->INT_FG);
	int len = 0;
	struct _USBState * ctx = &USBHSCTX;
	uint8_t * ctrl0buff = ctx->CTRL0BUFF;
	// int ep = ( intfgst & CMASK_UIS_ENDP ) >> 8;

	// First check if this it setup
#if (USBHS_IMPL==1)
	if( intfgst & CRB_UIF_SETUP_ACT )
#else
	if( (intfgst & CRB_UIF_TRANSFER) && !(intfgst & (1<<12)) && !(( intfgst & CMASK_UIS_ENDP ) >> 8) && (USBHS->UEP0_RX_CTRL & USBHS_UEP_R_SETUP_IS) )
#endif
	{
		/* Setup stage processing */
		UEP_CTRL_TX(0) = USBHS_UEP_T_RES_NAK | USBHS_UEP_T_TOG_DATA1;
		UEP_CTRL_RX(0) = USBHS_UEP_R_RES_NAK | USBHS_UEP_R_TOG_DATA1;

		/* Store All Setup Values */
		int USBHS_SetupReqType = USBHSCTX.USBHS_SetupReqType  = pUSBHS_SetupReqPak->bmRequestType;
		int USBHS_SetupReqCode = USBHSCTX.USBHS_SetupReqCode  = pUSBHS_SetupReqPak->bRequest;
		int USBHS_SetupReqLen = USBHSCTX.USBHS_SetupReqLen    = pUSBHS_SetupReqPak->wLength;
		int USBHS_SetupReqIndex = pUSBHS_SetupReqPak->wIndex;
		int USBHS_IndexValue = USBHSCTX.USBHS_IndexValue = ( pUSBHS_SetupReqPak->wIndex << 16 ) | pUSBHS_SetupReqPak->wValue;
#if ANYPRINTF
		if( usb_debug ) printf( "[USB] SETUP: %02x %02x %d %04x %08x\n", USBHS_SetupReqType, USBHS_SetupReqCode, USBHS_SetupReqLen, USBHS_SetupReqIndex, USBHS_IndexValue );
#endif

		if( ( USBHS_SetupReqType & USB_REQ_TYP_MASK ) != USB_REQ_TYP_STANDARD )
		{
#if FUSB_HID_INTERFACES > 0  || FUSB_USER_HANDLERS
			if( ( USBHS_SetupReqType & USB_REQ_TYP_MASK ) == USB_REQ_TYP_CLASS )
			{
				/* Class Request */
				switch( USBHS_SetupReqCode )
				{
#if FUSB_HID_INTERFACES > 0
					case HID_SET_REPORT:
#if FUSB_HID_USER_REPORTS
						len = HandleHidUserSetReportSetup( ctx, pUSBHS_SetupReqPak );
						if( len < 0 ) 
						{
							goto sendstall;
						}
						ctx->USBHS_SetupReqLen = len;
						UEP_CTRL_LEN(0) = 0;
						// Previously would have been a CTRL_RX = ACK && TOG, but not here on the 203.
						UEP_CTRL_RX(0) = USBHS_UEP_R_RES_ACK | USBHS_UEP_R_TOG_DATA1;
						UEP_CTRL_TX(0) = USBHS_UEP_T_TOG_DATA1;
						goto replycomplete;
					
					case HID_GET_REPORT:
						len = HandleHidUserGetReportSetup( ctx, pUSBHS_SetupReqPak );
						if( len < 0 ) 
						{
							goto sendstall;
						}
						ctx->USBHS_SetupReqLen = len;
						len = len >= USBHS_DEF_UEP0_SIZE ? USBHS_DEF_UEP0_SIZE : len;
						if( !ctx->pCtrlPayloadPtr )
						{
							len = HandleHidUserReportDataIn( ctx, ctrl0buff, len );
						}
						else
						{
							copyBuffer( ctrl0buff, ctx->pCtrlPayloadPtr, len );
							ctx->pCtrlPayloadPtr += len;
						}
						UEP_CTRL_LEN(0) = len;
						UEP_CTRL_TX(0) = USBHS_UEP_T_RES_ACK | USBHS_UEP_T_TOG_DATA1;
						ctx->USBHS_SetupReqLen -= len;
						goto replycomplete;
#endif
						break;

					case HID_SET_IDLE:
						if( USBHS_SetupReqIndex < FUSB_HID_INTERFACES )
							USBHSCTX.USBHS_HidIdle[ USBHS_SetupReqIndex ] = (uint8_t)( USBHS_IndexValue >> 8 );
						break;
					case HID_SET_PROTOCOL:
						if ( USBHS_SetupReqIndex < FUSB_HID_INTERFACES )
							USBHSCTX.USBHS_HidProtocol[USBHS_SetupReqIndex] = (uint8_t)USBHS_IndexValue;
						break;

					case HID_GET_IDLE:
						if( USBHS_SetupReqIndex < FUSB_HID_INTERFACES )
						{
							ctrl0buff[0] = USBHSCTX.USBHS_HidIdle[ USBHS_SetupReqIndex ];
							len = 1;
						}
						break;

					case HID_GET_PROTOCOL:
						if( USBHS_SetupReqIndex < FUSB_HID_INTERFACES )
						{
							ctrl0buff[0] = USBHSCTX.USBHS_HidProtocol[ USBHS_SetupReqIndex ];
							len = 1;
						}
						break;
#endif
					default:
#if FUSB_USER_HANDLERS
						len = HandleSetupCustom( ctx, USBHS_SetupReqCode );
					
						if( len )
						{
							if( len < 0 ) {
								len = 0;
								ctx->USBHS_SetupReqLen = 0;
							}
							else
							{
								ctx->USBHS_SetupReqLen = len;
								copyBuffer( ctrl0buff, ctx->pCtrlPayloadPtr, len );
								// printf("%02x-%02x-%02x-%02x-%02x-%02x-%02x\n", ctrl0buff[0], ctrl0buff[1], ctrl0buff[2], ctrl0buff[3], ctrl0buff[4], ctrl0buff[5], ctrl0buff[6]);
								ctx->pCtrlPayloadPtr += len;
							}
							
							if( ctx->USBHS_SetupReqType & USBHS_DEF_UEP_IN || ctx->USBHS_SetupReqLen == 0)
							{
								len = len >= USBHS_DEF_UEP0_SIZE ? USBHS_DEF_UEP0_SIZE : len;
								UEP_CTRL_LEN(0) = len;
								UEP_CTRL_TX(0) = USBHS_UEP_T_TOG_DATA1 | USBHS_UEP_T_RES_ACK;
								ctx->USBHS_SetupReqLen -= len;
							}
							else UEP_CTRL_RX(0)= USBHS_UEP_R_TOG_DATA1 | USBHS_UEP_R_RES_ACK;
							// UEP_CTRL_LEN(0) = len;
							// UEP_CTRL_TX(0) = CHECK_USBHS_UEP_T_AUTO_TOG | USBHS_UEP_T_RES_ACK | USBHS_UEP_T_TOG;
							// ctx->USBHS_SetupReqLen -= len;
							// goto epzero_rxtx;
							goto replycomplete;
						}
						else
#endif
						{
							goto sendstall;
						}
						break;
				}
			}
#else
			;
#endif
		}
		else
		{
			/* usb standard request processing */
			switch( USBHS_SetupReqCode )
			{
				/* get device/configuration/string/report/... descriptors */
				case USB_GET_DESCRIPTOR:
				{
					const struct descriptor_list_struct * e = descriptor_list;
					const struct descriptor_list_struct * e_end = e + DESCRIPTOR_LIST_ENTRIES;
					for( ; e != e_end; e++ )
					{
						if( e->lIndexValue == USBHS_IndexValue )
						{
							ctx->pCtrlPayloadPtr = (uint8_t*)e->addr;
							len = e->length;
							break;
						}
					}
					if( e == e_end ) // If descriptor list is empty
					{
						goto sendstall;
					}

					/* Copy Descriptors to Endp0 DMA buffer */
					if( ctx->USBHS_SetupReqLen > len ) ctx->USBHS_SetupReqLen = len;
					len = ( USBHS_SetupReqLen >= USBHS_DEF_UEP0_SIZE ) ? USBHS_DEF_UEP0_SIZE : USBHS_SetupReqLen;
					copyBuffer( ctrl0buff, ctx->pCtrlPayloadPtr, len );
					ctx->pCtrlPayloadPtr += len;
				}
				break;

				/* Set usb address */
				case USB_SET_ADDRESS:
					ctx->USBHS_DevAddr = (uint8_t)( ctx->USBHS_IndexValue & 0xFF );
					// NOTE: Do not actually set addres here!  If we do, we won't get the PID_IN associated with this SETUP.
					break;

				/* Get usb configuration now set */
				case USB_GET_CONFIGURATION:
					ctrl0buff[0] = ctx->USBHS_DevConfig;
					if( ctx->USBHS_SetupReqLen > 1 )
						ctx->USBHS_SetupReqLen = 1;
					break;

				/* Set usb configuration to use */
				case USB_SET_CONFIGURATION:
					ctx->USBHS_DevConfig = (uint8_t)( ctx->USBHS_IndexValue & 0xFF );
					ctx->USBHS_DevEnumStatus = 0x01;
					for(int ep = 1; ep < FUSB_MAX_EP_CNT; ep++) {
						// reset all DATAx
						UEP_CTRL_RX(ep) &= ~USBHS_UEP_R_TOG_DATA1;
						UEP_CTRL_TX(ep) &= ~USBHS_UEP_T_TOG_DATA1;
					}
					break;

