root643/unsolo-key/ch32fun/extralibs/hsusb.c
				/* Clear or disable one usb feature */
				case USB_CLEAR_FEATURE:
#if FUSB_SUPPORTS_SLEEP
					if( ( USBHS_SetupReqType & USB_REQ_RECIP_MASK ) == USB_REQ_RECIP_DEVICE )
					{
						/* clear one device feature */
						if( (uint8_t)( USBHS_IndexValue & 0xFF ) == USB_REQ_FEAT_REMOTE_WAKEUP )
						{
							/* clear usb sleep status, device not prepare to sleep */
							ctx->USBHS_DevSleepStatus &= ~0x01;
						}
						else
						{
							goto sendstall;
						}
					}
					else
#endif
					if( ( USBHS_SetupReqType & USB_REQ_RECIP_MASK ) == USB_REQ_RECIP_ENDP )
					{
						if( (uint8_t)( USBHS_IndexValue & 0xFF ) == USB_REQ_FEAT_ENDP_HALT )
						{
							/* Clear End-point Feature */
							int ep = USBHS_SetupReqIndex & 0xf;
							if( ctx->endpoints[ep].mode ) 
							{
								// UEP_CTRL_TX(ep) = USBHS_UEP_T_RES_STALL;
								if( USBHS_SetupReqIndex & USBHS_DEF_UEP_IN  && (ctx->endpoints[ep].mode & USBHS_EP_MODE_TX) ) UEP_CTRL_TX(ep) = USBHS_UEP_T_RES_NAK;
								else if( USBHS_SetupReqIndex & USBHS_DEF_UEP_OUT && (ctx->endpoints[ep].mode & USBHS_EP_MODE_RX) ) UEP_CTRL_RX(ep) = USBHS_UEP_R_RES_ACK;
								else 
								{
									goto sendstall;
								}
							}
							else
							{
								goto sendstall;
							}
						}
						else
						{
							goto sendstall;
						}
					}
					else
					{
						goto sendstall;
					}
					break;

				/* set or enable one usb feature */
				case USB_SET_FEATURE:
					if( ( USBHS_SetupReqType & USB_REQ_RECIP_MASK ) == USB_REQ_RECIP_DEVICE )
					{
#if FUSB_SUPPORTS_SLEEP
						/* Set Device Feature */
						if( (uint8_t)( USBHS_IndexValue & 0xFF ) == USB_REQ_FEAT_REMOTE_WAKEUP )
						{
							/* Set Wake-up flag, device prepare to sleep */
							USBHS_DevSleepStatus |= 0x01;
						}
						else
#endif
						{
							goto sendstall;
						}
					}
					else if( ( USBHS_SetupReqType & USB_REQ_RECIP_MASK ) == USB_REQ_RECIP_ENDP )
					{
						/* Set Endpoint Feature */
						if( (uint8_t)( USBHS_IndexValue & 0xFF ) == USB_REQ_FEAT_ENDP_HALT )
						{
							int ep = USBHS_SetupReqIndex & 0xf;
							if( ctx->endpoints[ep].mode )
							{
								if( (USBHS_SetupReqIndex & USBHS_DEF_UEP_IN) && (ctx->endpoints[ep].mode & USBHS_EP_MODE_TX) ) UEP_CTRL_TX(ep) = ( UEP_CTRL_TX(ep) & ~USBHS_UEP_T_RES_MASK ) | USBHS_UEP_T_RES_STALL;
								else if( (USBHS_SetupReqIndex & USBHS_DEF_UEP_OUT) && (ctx->endpoints[ep].mode & USBHS_EP_MODE_RX) ) UEP_CTRL_RX(ep) = ( UEP_CTRL_RX(ep) & ~USBHS_UEP_R_RES_MASK ) | USBHS_UEP_R_RES_STALL;
								else 
								{
									goto sendstall;
								}
							}
						}
						else
						{
							goto sendstall;
						}
					}
					else
					{
						goto sendstall;
					}
					break;

				/* This request allows the host to select another setting for the specified interface  */
				case USB_GET_INTERFACE:
					ctrl0buff[0] = 0x00;
					if( USBHS_SetupReqLen > 1 ) USBHS_SetupReqLen = 1;
					break;

				case USB_SET_INTERFACE:
					break;

				/* host get status of specified device/interface/end-points */
				case USB_GET_STATUS:
					ctrl0buff[0] = 0x00;
					ctrl0buff[1] = 0x00;
					if( ( USBHS_SetupReqType & USB_REQ_RECIP_MASK ) == USB_REQ_RECIP_DEVICE )
					{
#if FUSB_SUPPORTS_SLEEP
						ctrl0buff[0] = (ctx->USBHS_DevSleepStatus & 0x01)<<1;
#else
						ctrl0buff[0] = 0x00;
#endif
					}
					else if( ( USBHS_SetupReqType & USB_REQ_RECIP_MASK ) == USB_REQ_RECIP_ENDP )
					{
						int ep = USBHS_SetupReqIndex & 0xf;
						if( ctx->endpoints[ep].mode )
						{
							if( USBHS_SetupReqIndex & USBHS_DEF_UEP_IN && (ctx->endpoints[ep].mode & USBHS_EP_MODE_TX) ) ctrl0buff[0] = ( UEP_CTRL_TX(ep) & USBHS_UEP_T_RES_MASK ) == USBHS_UEP_T_RES_STALL;
							else if( USBHS_SetupReqIndex & USBHS_DEF_UEP_OUT && (ctx->endpoints[ep].mode & USBHS_EP_MODE_RX) ) ctrl0buff[0] = ( UEP_CTRL_RX(ep) & USBHS_UEP_R_RES_MASK ) == USBHS_UEP_R_RES_STALL;
							else goto sendstall;
						}
						else
						{
							goto sendstall;
						}
					}
					else
					{
						goto sendstall;
					}
					if( USBHS_SetupReqLen > 2 )
						USBHS_SetupReqLen = 2;
					break;

				default:
					goto sendstall;
					break;
			}
		}
	// epzero_rxtx:
		{
			/* end-point 0 data Tx/Rx */
			if( USBHS_SetupReqType & USBHS_DEF_UEP_IN )
			{
				len = ( ctx->USBHS_SetupReqLen > USBHS_DEF_UEP0_SIZE )? USBHS_DEF_UEP0_SIZE : ctx->USBHS_SetupReqLen;
				ctx->USBHS_SetupReqLen -= len;
				UEP_CTRL_LEN(0) = len;
				UEP_CTRL_TX(0) = USBHS_UEP_T_RES_ACK | USBHS_UEP_T_TOG_DATA1;
			}
			else
			{
				if( ctx->USBHS_SetupReqLen == 0 )
				{
					UEP_CTRL_LEN(0) = 0;
					UEP_CTRL_TX(0) = USBHS_UEP_T_RES_ACK | USBHS_UEP_T_TOG_DATA1;
				}
				else
				{
					UEP_CTRL_RX(0) = USBHS_UEP_R_RES_ACK | USBHS_UEP_R_TOG_DATA1;
				}
			}
		}

		goto replycomplete;
		
sendstall:
		{
			// if one request not support, return stall.  Stall means permanent error.
			UEP_CTRL_TX(0) = USBHS_UEP_T_TOG_DATA1 | USBHS_UEP_T_RES_STALL;
			UEP_CTRL_RX(0) = USBHS_UEP_R_TOG_DATA1 | USBHS_UEP_R_RES_STALL;
		}

replycomplete:
		USBHS->INT_FG = intfgst;
		USBHS_DONE_RX(0);

	}
	else if( intfgst & CRB_UIF_TRANSFER )
	{
		int token = ( intfgst & CMASK_UIS_TOKEN ) >> 12;
		int ep = ( intfgst & CMASK_UIS_ENDP ) >> 8;
		
#if ANYPRINTF
		if( usb_debug ) printf( "[USB] TRANSFER, token = %02x, ep = %d, bmRequestType = %02x, bRequest = %02x\n", token, ep, pUSBHS_SetupReqPak->bmRequestType, pUSBHS_SetupReqPak->bRequest );
#endif
		switch ( token )
		{
		case CUIS_TOKEN_IN:
			if( ep )
			{
				if( ctx->endpoints[ep].mode )
				{
#if FUSB_USER_HANDLERS
					len = HandleInRequest( ctx, ep, ctx->endpoints[ep].in, 0 );
#endif
					UEP_CTRL_TX(ep) ^= USBHS_UEP_T_TOG_DATA1;
					if( len )
					{
						if( len < 0 ) len = 0;
						UEP_CTRL_LEN(ep) = len;
						UEP_CTRL_TX(ep) = ( UEP_CTRL_TX(ep) & ~USBHS_UEP_T_RES_MASK ) | USBHS_UEP_T_RES_ACK;
					}
					else
					{
						UEP_CTRL_TX(ep) = ( UEP_CTRL_TX(ep) & ~USBHS_UEP_T_RES_MASK ) | USBHS_UEP_T_RES_NAK;
					}
					ctx->endpoints[ep].busy = 0;
				}
			}
			else // EP0
			{
				/* end-point 0 data in interrupt */
				if( ctx->USBHS_SetupReqLen == 0 )
				{
					UEP_CTRL_RX(0) = USBHS_UEP_R_TOG_DATA1 | USBHS_UEP_R_RES_ACK;
				}

				ctx->USBHS_errata_dont_send_endpoint_in_window = 0;

				if( ctx->pCtrlPayloadPtr )
				{
					// Shortcut mechanism, for descriptors or if the user wants it.
					len = ctx->USBHS_SetupReqLen >= USBHS_DEF_UEP0_SIZE ? USBHS_DEF_UEP0_SIZE : ctx->USBHS_SetupReqLen;
					copyBuffer( ctrl0buff, ctx->pCtrlPayloadPtr, len ); // FYI -> Would need to do this if using DMA
					ctx->USBHS_SetupReqLen -= len;
					if( ctx->USBHS_SetupReqLen > 0 )
						ctx->pCtrlPayloadPtr += len;
					else
						ctx->pCtrlPayloadPtr = 0;

