root643/unsolo-key/ch32fun/extralibs/hsusb.c
					UEP_CTRL_LEN(0) = len;
					UEP_CTRL_TX(0) ^= USBHS_UEP_T_TOG_DATA1;
#if (USBHS_IMPL==2)
					UEP_CTRL_TX(0) = ( UEP_CTRL_TX(0) & ~USBHS_UEP_T_RES_MASK) | USBHS_UEP_T_RES_ACK; // clear
#endif
				}
				else if ( ( ctx->USBHS_SetupReqType & USB_REQ_TYP_MASK ) != USB_REQ_TYP_STANDARD )
				{
					len = ctx->USBHS_SetupReqLen >= USBHS_DEF_UEP0_SIZE ? USBHS_DEF_UEP0_SIZE : ctx->USBHS_SetupReqLen;
#if FUSB_HID_USER_REPORTS
					if( len && USBHSCTX.USBHS_SetupReqCode == HID_GET_REPORT )
					{
						len = HandleHidUserReportDataIn( ctx, ctrl0buff, len );
						UEP_CTRL_LEN(0) = len;
						UEP_CTRL_TX(0) ^= USBHS_UEP_T_TOG_DATA1;
						ctx->USBHS_SetupReqLen -= len;
						ctx->pCtrlPayloadPtr += len;
					}	
#endif
#if FUSB_USER_HANDLERS
					if( len && USBHSCTX.USBHS_SetupReqCode != HID_GET_REPORT )
					{
						len = HandleInRequest( ctx, 0, ctrl0buff, len );
						UEP_CTRL_LEN(0) = len;
						UEP_CTRL_TX(0) ^= USBHS_UEP_T_TOG_DATA1;
						ctx->USBHS_SetupReqLen -= len;
						ctx->pCtrlPayloadPtr += len;
					}
#endif
				}
				else
				{
					switch( USBHSCTX.USBHS_SetupReqCode )
					{
						case USB_GET_DESCRIPTOR:
							break;

						case USB_SET_ADDRESS:
							USBHS->DEV_AD = ctx->USBHS_DevAddr;
							break;

						default:
							break;
					}
				}
			}
			USBHS_DONE_TX(ep);
			break;

		/* data-out stage processing */
		case CUIS_TOKEN_OUT:
#if (USBHS_IMPL == 1)
			len = USBHS->RX_LEN;
#else
			if( ep ) len = UEP_RX_LEN(ep);
			else len = USBHS->UEP0_RX_LEN;
#endif
			switch( ep )
			{
				/* end-point 0 data out interrupt */
				case USBHS_DEF_UEP0:
#if (USBHS_IMPL==1)
					if( intfgst & CRB_UIS_TOG_OK )
#else
					if( USBHS->UEP0_RX_CTRL & (1<<4) ) // RB_UEP_R_TOG_MATCH
#endif
					{
#if FUSB_HID_USER_REPORTS
						if( ctx->USBHS_SetupReqCode == HID_SET_REPORT )
						{
							uint8_t * cptr = ctx->pCtrlPayloadPtr;
							if( !cptr )
							{
								HandleHidUserReportDataOut( ctx, ctrl0buff, len );
							}
							else
							{
								int remain = ctx->USBHS_SetupReqLen - len;
								if( remain < 0 )
								{
									len += remain;
									remain = 0;
								}
								copyBuffer( cptr, ctrl0buff, len );
								ctx->USBHS_SetupReqLen = remain;
								if( remain > 0 )
									ctx->pCtrlPayloadPtr = cptr + len;
								else
									ctx->pCtrlPayloadPtr = 0;
							}
						}
#endif
#if FUSB_USER_HANDLERS
						if ( ctx->USBHS_SetupReqCode != HID_SET_REPORT )
						{
							HandleDataOut( ctx, ep, ctrl0buff, len );
						}
#endif
						if( ctx->USBHS_SetupReqLen == 0 )
						{
#if FUSB_HID_USER_REPORTS
							if( ctx->USBHS_SetupReqCode == HID_SET_REPORT )
								HandleHidUserReportOutComplete( ctx );
#endif
							// Only set this flag for OUT requests (e.g. SET_LINE_CODING).
							// For IN requests (e.g. GET_DESCRIPTOR), don't set it.
							if ( ( ctx->USBHS_SetupReqType & USB_REQ_TYP_IN ) == 0 )
							{
								ctx->USBHS_errata_dont_send_endpoint_in_window = 1;
							}
							UEP_CTRL_LEN(0) = 0;
							UEP_CTRL_TX(0) = USBHS_UEP_T_TOG_DATA1 | USBHS_UEP_T_RES_ACK;
						}
						else
						{
							UEP_CTRL_RX(0) ^= USBHS_UEP_R_TOG_DATA1;
#if (USBHS_IMPL==2)
							UEP_CTRL_RX(0) = ( UEP_CTRL_RX(0) & ~USBHS_UEP_R_RES_MASK) | USBHS_UEP_R_RES_ACK; // clear
#endif	
						}
					}
					USBHS_DONE_RX(0);
					break;

				default:
#if (USBHS_IMPL==1)
					if( intfgst & CRB_UIS_TOG_OK )
#else
					if( UEP_CTRL_RX(ep) & (1<<4) ) // RB_UEP_R_TOG_MATCH
#endif
					{
						uint_fast8_t rx_ctrl = UEP_CTRL_RX(ep) & ~USBHS_UEP_R_RES_MASK;
						rx_ctrl ^= USBHS_UEP_R_TOG_DATA1;
#if FUSB_OUT_FLOW_CONTROL > 0
						rx_ctrl |= USBHS_UEP_R_RES_NAK; // ACK later when receiver is ready
#else
						rx_ctrl |= USBHS_UEP_R_RES_ACK;
#endif
						UEP_CTRL_RX(ep) = rx_ctrl;
#if FUSB_USER_HANDLERS
						HandleDataOut( ctx, ep, ctx->endpoints[ep].out, len );
#endif
					}
					USBHS_DONE_RX(ep);
					break;
			}
			break;

#if (USBHS_IMPL==1)
		case CUIS_TOKEN_SOF:
			{
#if (FUSB_SOF_HSITRIM)
				int32_t diff = (int64_t)(systick_local - ctx->USBHS_sof_timestamp);
				uint32_t trim = (RCC->CTLR & RCC_HSITRIM) >> 3;
				if( diff > TICKS_PER_HSITRIM && (trim > 0)) {
					uint32_t regtemp;
					regtemp = RCC->CTLR & ~RCC_HSITRIM;
					RCC->CTLR = regtemp | (--trim)<<3;
				}
				else if( diff < 0 && diff < (TICKS_PER_HSITRIM*-1) && (trim < 31))
				{
					uint32_t regtemp;
					regtemp = RCC->CTLR & ~RCC_HSITRIM;
					RCC->CTLR = regtemp | (++trim)<<3;;
				}
				ctx->USBHS_sof_timestamp = systick_local + Ticks_from_Us(125);
#endif
				USBHS->INT_FG = CRB_UIF_HST_SOF;
			}
			break;
#endif

		default :
			break;
		}
		USBHS->INT_FG = CRB_UIF_TRANSFER;
	}
	else if( intfgst & CRB_UIF_BUS_RST )
	{
#if ANYPRINTF
		if( usb_debug ) printf( "[USB] RESET\n" );
#endif
		/* usb reset interrupt processing */
		ctx->USBHS_DevConfig = 0;
		ctx->USBHS_DevAddr = 0;
		ctx->USBHS_DevSleepStatus = 0;
		ctx->USBHS_DevEnumStatus = 0;

		USBHS->DEV_AD = 0;
		USBHS_InternalFinishSetup();
		USBHS->INT_FG = CRB_UIF_BUS_RST;
	}
	else if( intfgst & CRB_UIF_SUSPEND )
	{
#if ANYPRINTF
		if( usb_debug ) printf( "[USB] SUSPEND\n" );
#endif
		USBHS->INT_FG = CRB_UIF_SUSPEND;
		Delay_Us(10);
		/* usb suspend interrupt processing */
		if( USBHS->MIS_ST & USBHS_UMS_SUSPEND )
		{
			ctx->USBHS_DevSleepStatus |= 0x02;
			if( ctx->USBHS_DevSleepStatus == 0x03 )
			{
				/* Handling usb sleep here */
				//TODO: MCU_Sleep_Wakeup_Operate( );
			}
		}
		else
		{
			ctx->USBHS_DevSleepStatus &= ~0x02;
		}
	}
	else
	{
			/* other interrupts */
			USBHS->INT_FG = intfgst & 0xff;
	}


#if FUSB_IO_PROFILE
	funDigitalWrite( DEBUG_PIN, 0 );
#endif

#if FUSB_USE_HPE
	// asm volatile( "mret" );
#endif
}

void USBHS_InternalFinishSetup()
{
#if USBHS_IMPL == 1
	USBHS->UEP_CONFIG = 0;
#else
	USBHS->UEP_TX_EN = 0;
	USBHS->UEP_RX_EN = 0;
#endif

#if FUSB_EP1_MODE
#if !(defined FUSB_EP1_SIZE && !FUSB_EP1_SIZE)
	USBHSCTX.endpoints[1].buffer = USBHSCTX.ep1_buffer;
#endif
	USBHSCTX.endpoints[1].mode = FUSB_EP1_MODE;
#ifndef FUSB_EP1_SIZE
	USBHS->UEP1_MAX_LEN = FUSB_EP_SIZE;
	USBHSCTX.endpoints[1].size = FUSB_EP_SIZE;
#else
	USBHS->UEP1_MAX_LEN = FUSB_EP1_SIZE;
	USBHSCTX.endpoints[1].size = FUSB_EP1_SIZE;
#endif
#endif

#if FUSB_EP2_MODE
#if !(defined FUSB_EP2_SIZE && !FUSB_EP2_SIZE)
	USBHSCTX.endpoints[2].buffer = USBHSCTX.ep2_buffer;
#endif
	USBHSCTX.endpoints[2].mode = FUSB_EP2_MODE;
#ifndef FUSB_EP2_SIZE
	USBHS->UEP2_MAX_LEN = FUSB_EP_SIZE;
	USBHSCTX.endpoints[2].size = FUSB_EP_SIZE;
#else
	USBHS->UEP2_MAX_LEN = FUSB_EP2_SIZE;
	USBHSCTX.endpoints[2].size = FUSB_EP2_SIZE;
#endif
#endif

#if FUSB_EP3_MODE
#if !(defined FUSB_EP3_SIZE && !FUSB_EP3_SIZE)
	USBHSCTX.endpoints[3].buffer = USBHSCTX.ep3_buffer;
#endif
	USBHSCTX.endpoints[3].mode = FUSB_EP3_MODE;
#ifndef FUSB_EP3_SIZE
	USBHS->UEP3_MAX_LEN = FUSB_EP_SIZE;
	USBHSCTX.endpoints[3].size = FUSB_EP_SIZE;
#else
	USBHS->UEP3_MAX_LEN = FUSB_EP3_SIZE;
	USBHSCTX.endpoints[3].size = FUSB_EP3_SIZE;
#endif
#endif

#if FUSB_EP4_MODE
#if !(defined FUSB_EP4_SIZE && !FUSB_EP4_SIZE)
	USBHSCTX.endpoints[4].buffer = USBHSCTX.ep4_buffer;
#endif
	USBHSCTX.endpoints[4].mode = FUSB_EP4_MODE;
#ifndef FUSB_EP4_SIZE
	USBHS->UEP4_MAX_LEN = FUSB_EP_SIZE;
	USBHSCTX.endpoints[4].size = FUSB_EP_SIZE;
#else
	USBHS->UEP4_MAX_LEN = FUSB_EP4_SIZE;
	USBHSCTX.endpoints[4].size = FUSB_EP4_SIZE;
#endif
#endif

#if FUSB_EP5_MODE
#if !(defined FUSB_EP5_SIZE && !FUSB_EP5_SIZE)
	USBHSCTX.endpoints[5].buffer = USBHSCTX.ep5_buffer;
#endif
	USBHSCTX.endpoints[5].mode = FUSB_EP5_MODE;
#ifndef FUSB_EP5_SIZE
	USBHS->UEP5_MAX_LEN = FUSB_EP_SIZE;
	USBHSCTX.endpoints[5].size = FUSB_EP_SIZE;
#else
	USBHS->UEP5_MAX_LEN = FUSB_EP5_SIZE;
	USBHSCTX.endpoints[5].size = FUSB_EP5_SIZE;
#endif
#endif

#if FUSB_EP6_MODE
#if !(defined FUSB_EP6_SIZE && !FUSB_EP6_SIZE)
	USBHSCTX.endpoints[6].buffer = USBHSCTX.ep6_buffer;
#endif
	USBHSCTX.endpoints[6].mode = FUSB_EP6_MODE;
#ifndef FUSB_EP6_SIZE
	USBHS->UEP6_MAX_LEN = FUSB_EP_SIZE;
	USBHSCTX.endpoints[6].size = FUSB_EP_SIZE;
#else
	USBHS->UEP6_MAX_LEN = FUSB_EP6_SIZE;
	USBHSCTX.endpoints[6].size = FUSB_EP6_SIZE;
#endif
#endif

