root643/unsolo-key/ch32fun/extralibs/hsusb.c
#if FUSB_EP7_MODE
#if !(defined FUSB_EP7_SIZE && !FUSB_EP7_SIZE)
	USBHSCTX.endpoints[7].buffer = USBHSCTX.ep7_buffer;
#endif
	USBHSCTX.endpoints[7].mode = FUSB_EP7_MODE;
#ifndef FUSB_EP7_SIZE
	USBHS->UEP7_MAX_LEN = FUSB_EP_SIZE;
	USBHSCTX.endpoints[7].size = FUSB_EP_SIZE;
#else
	USBHS->UEP7_MAX_LEN = FUSB_EP7_SIZE;
	USBHSCTX.endpoints[7].size = FUSB_EP7_SIZE;
#endif
#endif

	USBHS->UEP0_DMA = (uintptr_t)USBHSCTX.CTRL0BUFF;
	USBHS->UEP0_MAX_LEN = USBHS_DEF_UEP0_SIZE;
	UEP_CTRL_LEN(0) = 0;
	UEP_TX_EN(0);
	UEP_RX_EN(0);
	UEP_CTRL_TX(0) = USBHS_UEP_T_RES_NAK;
	UEP_CTRL_RX(0) = USBHS_UEP_R_RES_ACK;
	USBHSCTX.endpoints[0].buffer = USBHSCTX.CTRL0BUFF;
	USBHSCTX.endpoints[0].mode = USBHS_EP_MODE_TX | USBHS_EP_MODE_RX;

	for( int i = 1; i < FUSB_MAX_EP_CNT; i++ )
	{
		USBHS_EP_TypeDef * endpoint = &USBHSCTX.endpoints[i];
		UEP_CTRL_LEN(i) = 0;
		if( endpoint->mode & USBHS_EP_MODE_TX )
		{
			UEP_CTRL_TX(i) = USBHS_UEP_T_RES_NAK;
			UEP_TX_EN(i);
			UEP_DMA_TX(i) = (uintptr_t)endpoint->buffer;
		}
		else if( USBHSCTX.endpoints[i].mode & USBHS_EP_MODE_RX )
		{
			UEP_CTRL_RX(i) = USBHS_UEP_R_RES_ACK;
			UEP_RX_EN(i);
			UEP_DMA_RX(i) = (uintptr_t)endpoint->buffer;

		}

#if USBHS_IMPL == 1
		if( endpoint->mode & USBHS_EP_MODE_DOUBLE )
		{
			UEP_MODE_DOUBLE(i);
			if( endpoint->mode & USBHS_EP_MODE_TX )
			{
				UEP_DMA_RX(i) = ((uintptr_t)endpoint->buffer) + endpoint->size;
			}
			else
			{
				UEP_DMA_TX(i) = ((uintptr_t)endpoint->buffer) + endpoint->size;
			}
		}
		else if( USBHSCTX.endpoints[i].mode & USBHS_EP_MODE_ISO )
		{
			UEP_MODE_ISO(i);
		}
#else
		if( USBHSCTX.endpoints[i].mode & USBHS_EP_MODE_TX_BURST )
		{
			UEP_MODE_TX_BURST(i);
		}
		else if( USBHSCTX.endpoints[i].mode & USBHS_EP_MODE_RX_BURST )
		{
			UEP_MODE_RX_BURST(i);
		}
#endif

		USBHSCTX.endpoints[i].busy = 0;
	}
}

#if FUSB_OUT_FLOW_CONTROL > 0
void USBHS_RxReady(int endp)
{
	// Just ACK previous transfer for the RX to get ready
	UEP_CTRL_RX(endp) &= ~USBHS_UEP_R_RES_MASK;
}
#endif

int USBHSSetup()
{
#if defined (CH584_CH585)
	R8_USBHS_PLL_CTRL = USBHS_PLL_EN;
	R16_PIN_CONFIG |= RB_PIN_USB2_EN;
#elif defined (CH32V30x)
#if (FUNCONF_SYSTEM_CORE_CLOCK != 144000000) && (FUNCONF_SYSTEM_CORE_CLOCK != 96000000) && (FUNCONF_SYSTEM_CORE_CLOCK != 48000000)
#error "CH32V30x need 144/96/48MHz main clock for USB to work"
#endif
	RCC->CFGR2 &= ~((7 << 24) | (1 << 27) | (3 << 28) | (1<<31));
#if (FUNCONF_USE_HSE)
	RCC->CFGR2 = RCC_USBHSSRC | RCC_USBHSPLL | 1<< RCC_USBHSCLK_OFFSET | 1 << RCC_USBHSDIV_OFFSET;
#else
#warning "Using HSI"
	RCC->CFGR2 = RCC_USBHSSRC | RCC_USBHSPLL | RCC_USBHSPLLSRC | 1<< RCC_USBHSCLK_OFFSET | 1 << RCC_USBHSDIV_OFFSET;
#endif
	RCC->AHBPCENR |= RCC_USBHSEN | RCC_AHBPeriph_DMA1;
#else
#error "Need to add USB clock setup for this chip"
#endif

#if (USBHS_IMPL==1)
	// Force module to reset.
	USBHS->BASE_CTRL = USBHS_UC_CLR_ALL | USBHS_UC_RESET_SIE;
	Delay_Us(10);
	USBHS->BASE_CTRL = 0;
	USBHS->HOST_CTRL = USBHS_UH_PHY_SUSPENDM;
	// Initialize USB device config
	USBHS->HOST_CTRL = USBHS_UH_PHY_SUSPENDM;
	USBHS->BASE_CTRL = USBHS_UC_DMA_EN | USBHS_UC_INT_BUSY | (FUSB_SPEED<<5);
	USBHS->INT_EN = USBHS_UIE_SETUP_ACT | USBHS_UIE_TRANSFER | USBHS_UIE_DETECT | USBHS_UIE_SUSPEND;
#if (FUSB_SOF_HSITRIM)
	USBHS->INT_EN |= USBHS_UIE_SOF_ACT;
#endif
	USBHS_InternalFinishSetup();
	USBHS->BASE_CTRL |= USBHS_UC_DEV_PU_EN;
#else
	// Force module to reset.
	USBHS->BASE_CTRL = USBHS_UD_RST_LINK | USBHS_UD_PHY_SUSPENDM;
	Delay_Us(10);
	USBHS->BASE_CTRL = 0;
	// Initialize USB device config
	USBHS->INT_EN    = USBHS_UDIE_BUS_RST | USBHS_UDIE_SUSPEND | USBHS_UDIE_BUS_SLEEP | USBHS_UDIE_LPM_ACT | USBHS_UDIE_TRANSFER | USBHS_UDIE_LINK_RDY;
	USBHS_InternalFinishSetup();
	USBHS->BASE_MODE = FUSB_SPEED;
	USBHS->BASE_CTRL = USBHS_UD_DEV_EN | USBHS_UD_DMA_EN | USBHS_UD_LPM_EN | USBHS_UD_PHY_SUSPENDM;
#endif
	
	NVIC_EnableIRQ( USBHS_IRQn );

#if FUSB_IO_PROFILE
	funPinMode( DEBUG_PIN, GPIO_CFGLR_OUT_50Mhz_PP );
#endif

	// Go on-bus.
	return 0;
}

void USBHSReset()
{
	NVIC_DisableIRQ( USBHS_IRQn );
#if (USBHS_IMPL == 1) // CH32V30x CH565_CH569
	USBHS->BASE_CTRL = USBHS_UC_CLR_ALL | USBHS_UC_RESET_SIE;
	Delay_Us(10);
	USBHS->BASE_CTRL = 0;
	USBHS->HOST_CTRL = USBHS_UH_PHY_SUSPENDM;
#else // CH584_CH585
	USBHS->BASE_CTRL = USBHS_UD_RST_LINK | USBHS_UD_PHY_SUSPENDM;
	Delay_Us(10);
	USBHS->BASE_CTRL = 0;
#endif
}

static inline uint8_t * USBHS_GetEPBufferIfAvailable( int endp )
{
	if( USBHSCTX.endpoints[endp].busy ) return 0;
	return USBHSCTX.endpoints[endp].in;
}

static inline int USBHS_SendEndpoint( int endp, int len )
{
	if( USBHSCTX.USBHS_errata_dont_send_endpoint_in_window || USBHSCTX.endpoints[endp].busy ) return -1;
	// This prevents sending while ep0 is receiving
	if( USBHSCTX.USBHS_SetupReqLen > 0 ) return -2;
	// Check if in SETUP request
	// if( USBHS->UEP0_RX_CTRL & USBHS_UEP_R_SETUP_IS ) return -3;
	NVIC_DisableIRQ( USBHS_IRQn );
	UEP_CTRL_LEN( endp ) = len;
	UEP_CTRL_TX( endp ) = ( UEP_CTRL_TX( endp ) & ~USBHS_UEP_T_RES_MASK ) | USBHS_UEP_T_RES_ACK;
	USBHSCTX.endpoints[endp].busy = 1;
	NVIC_EnableIRQ( USBHS_IRQn );
	return 0;
}

// If youre sending without copy, make sure data buffer is 4 bytes aligned
static inline int USBHS_SendEndpointNEW( int endp, const uint8_t* data, int len, int copy )
{
	if( USBHSCTX.USBHS_errata_dont_send_endpoint_in_window || USBHSCTX.endpoints[endp].busy ) return -1;
	// This prevents sending while ep0 is receiving
	if( USBHSCTX.USBHS_SetupReqLen > 0 ) return USBHSCTX.USBHS_SetupReqLen;
	
	if ( len )
	{
		if( copy )
		{
			if( !endp ) USBHS->UEP0_DMA = (uintptr_t)USBHSCTX.CTRL0BUFF;
			else UEP_DMA_TX( endp ) = (uintptr_t)USBHSCTX.endpoints[endp].in;

			uint8_t* dest = (endp?USBHSCTX.endpoints[endp].in:USBHSCTX.CTRL0BUFF);
			copyBuffer( dest, data, len );
		}
		else
		{
			if( !endp ) USBHS->UEP0_DMA = (uintptr_t)data;
			else UEP_DMA_TX( endp ) = (uintptr_t)data;
		}
	}
	// NVIC_DisableIRQ( USBHS_IRQn );
	UEP_CTRL_LEN( endp ) = len;
	UEP_CTRL_TX( endp ) = ( UEP_CTRL_TX( endp ) & ~USBHS_UEP_T_RES_MASK ) | USBHS_UEP_T_RES_ACK;
	USBHSCTX.endpoints[endp].busy = 1;
	// NVIC_EnableIRQ( USBHS_IRQn );
	return 0;
}

static inline int USBHS_SendACK( int endp, int tx )
{
	if( tx ) UEP_CTRL_TX( endp ) = ( UEP_CTRL_TX( endp ) & ~USBHS_UEP_T_RES_MASK ) | USBHS_UEP_T_RES_ACK;
	else UEP_CTRL_RX(endp) = ( UEP_CTRL_RX(endp) & ~USBHS_UEP_R_RES_MASK ) | USBHS_UEP_R_RES_ACK;
	return 0;
}

static inline int USBHS_SendNAK( int endp, int tx )
{
	if( tx ) UEP_CTRL_TX( endp ) = ( UEP_CTRL_TX( endp ) & ~USBHS_UEP_T_RES_MASK ) | USBHS_UEP_T_RES_NAK;
	else UEP_CTRL_RX(endp) = ( UEP_CTRL_RX(endp) & ~USBHS_UEP_R_RES_MASK ) | USBHS_UEP_R_RES_NAK;
	return 0;
}

#if defined( FUNCONF_USE_USBPRINTF ) && FUNCONF_USE_USBPRINTF
WEAK int HandleInRequest( struct _USBState *ctx, int endp, uint8_t *data, int len )
{
	return 0;
}

WEAK void HandleDataOut( struct _USBState *ctx, int endp, uint8_t *data, int len )
{
	if ( endp == 0 )
	{
		ctx->USBHS_SetupReqLen = 0; // To ACK
	}
}

WEAK int HandleSetupCustom( struct _USBState *ctx, int setup_code )
{
	int ret = -1;
	if ( ctx->USBHS_SetupReqType & USB_REQ_TYP_CLASS )
	{
		switch ( setup_code )
		{
			case CDC_SET_LINE_CODING:
			case CDC_SET_LINE_CTLSTE:
			case CDC_SEND_BREAK: ret = ( ctx->USBHS_SetupReqLen ) ? ctx->USBHS_SetupReqLen : -1; break;
			case CDC_GET_LINE_CODING: ret = ctx->USBHS_SetupReqLen; break;
			default: ret = 0; break;
		}
	}
	else
	{
		ret = 0; // Go to STALL
	}
	return ret;
}
#endif // FUNCONF_USE_USBPRINTF
